Tekla.Structures.Model.UI.Picker.PickObjectEnum
The possible model object pick types for a single object.

Tekla.Structures.Model.UI.Picker.PickObjectEnum.PICK_ONE_OBJECT
Pick one model object of any type.

Tekla.Structures.Model.UI.Picker.PickObjectEnum.PICK_ONE_PART
Pick one part.

Tekla.Structures.Model.UI.Picker.PickObjectEnum.PICK_ONE_WELD
Pick one welding.

Tekla.Structures.Model.UI.Picker.PickObjectEnum.PICK_ONE_BOLTGROUP
Pick one bolt group.

Tekla.Structures.Model.UI.Picker.PickObjectEnum.PICK_ONE_REINFORCEMENT
Pick one reinforcement.